<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML Basic 1.1//EN"
    "http://www.w3.org/TR/xhtml-basic/xhtml-basic11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>Standard Omg: UML, SysML, BPMN - analisi-disegno.com</title>
<meta name="keywords" content="UML, SysML, BPMN, standard, OMG" />
<meta name="description" content="Gli standard OMG per la rappresentazione dei sistemi, del software e dei processi di business (SysML, UML e BPMN) hanno alcune aree di sovrapposizione." />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<meta name="robots" content="noarchive" />
<meta name="author" content="Adriano Comai" />
<link rel="stylesheet" type="text/css" href="../analisi-disegno.css" />
</head>

<body>
<p class="iniziale">analisi-disegno.com</p>
	<p class="menu"><a href="../">Homepage</a>&nbsp;| 
	<a href="../notiziario.html">Notiziario</a>&nbsp;| <a href="../welcome_e.html">In English</a></p>
    <hr />
	
      <h1>Standard OMG: UML, SysML, BPMN</h1>
      <p>L'Object Management Group (<a href="http://www.omg.org" target="_blank">OMG</a>) &egrave; 
        un organismo che comprende le maggiori realt&agrave; del software internazionale.</p>
      <p>La sua attivit&agrave; principale &egrave; la definizione di standard, tra cui tre linguaggi 
        - notazioni complementari per la rappresentazione di software, sistemi e processi:</p>
      <ul>
        <li><a href="uml.htm">UML</a> (Unified Modeling Language) per la rappresentazione del software.</li>
        <li>SysML (System Modeling Language) per la rappresentazione dei sistemi &quot;non software&quot; o &quot;non 
          solo software&quot;.</li>
        <li><a href="../businessmodeling/bpmn.htm">BPMN</a> (Business Process Modeling Notation) per la rappresentazione dei processi di business.</li>
      </ul>
      <p>Tutto bene. Se non fosse che 
        i rispettivi campi di applicazione di questi standard si sovrappongono, 
        almeno in parte. Pu&ograve; quindi essere opportuno chiarire alcuni aspetti 
        per chi li vuole usare, ma non &egrave; addentro alle intricate logiche 
        dell'OMG.</p>
      <ol>
        <li>UML &egrave; nato prima, 
          nel 1997, ed ha avuto una notevole diffusione nel campo del software, 
          dove &egrave; diventato effettivamente lo standard internazionale. Ma 
          &egrave; stato anche usato molto per la rappresentazione di sistemi 
          non software, ad esempio sistemi hardware. E per la rappresentazione, 
          a livello di business, di processi e strutture organizzativi.</li>
        <li>BPMN &egrave; stato creato 
          al di fuori dall'OMG, nel 2004, dalla Business Process Management Initiative, 
          un consorzio di produttori di strumenti che giudicavano UML troppo poco 
          specifico per la rappresentazione dei processi di business.</li>
        <li>Nel 2006, BPMN &egrave; 
          stato adottato dall'OMG. Con una sovrapposizione, perch&eacute; l'unico 
          diagramma previsto da BPMN (Business Process Diagram) &egrave; un flow 
          chart, esattamente come l'Activity Diagram di UML, che usa una notazione 
          leggermente diversa.</li>
        <li>L'ipotesi di integrare UML 
          e BPMN (due standard in parziale sovrapposizione emanati e gestiti dallo 
          stesso organismo) &egrave; stata finora ostacolata dai produttori di 
          strumenti di modellazione. La prossima versione di BPMN, prevista per 
          il 2009, non risolver&agrave; il problema.</li>
        <li>Per rappresentare sistemi 
          &quot;non software&quot;, l'OMG ha pubblicato nel 2007 il nuovo standard 
          SysML. In questo caso, la sovrapposizione con UML &egrave; ancora pi&ugrave; 
          forte, ma al tempo stesso meno grave. Pi&ugrave; forte, perch&eacute; 
          UML e SysML hanno molti diagrammi in comune; peraltro, non tutti i diagrammi 
          UML sono inclusi in SysML, dove invece si trovano altri diagrammi non 
          previsti in UML. Ma meno grave, perch&eacute; SysML &egrave; un &quot;profilo&quot; 
          di UML, cio&egrave; una derivazione di UML compatibile con il linguaggio 
          base.</li>
      </ol>
      <p>In sintesi, ci sono aree di sovrapposizione. Quale standard usare? Di seguito, qualche indicazione di massima.</p>
      <p>Per chi deve rappresentare 
        processi di business, e null'altro, BPMN &egrave; una scelta conveniente. 
        Si pu&ograve; discutere sul fatto che sia pi&ugrave; o meno efficace ed 
        intuitiva di altre notazioni stile flow chart, ma &egrave; uno standard. 
        Tra l'altro, sono disponibili diversi strumenti, anche gratuiti, per la 
        modellazione BPMN.</p>
      <p>Per chi deve rappresentare, 
        nell'ambito del business modeling, anche altri aspetti organizzativi (strutture, 
        ruoli, responsabilit&agrave;), BPMN non basta, perch&eacute; rappresenta 
        solo i processi. Quindi conviene integrarlo o sostituirlo con UML. Esistono 
        strumenti che modellano entrambe le notazioni.</p>
      <p>Per chi deve rappresentare sistemi software, UML &egrave; la scelta naturale.</p>
      <p>Per chi deve rappresentare 
        sistemi &quot;non software&quot; o per i quali il software costituisce 
        solo una parte e non il tutto, pu&ograve; essere utile SysML. Ha alcuni 
        costrutti che lo rendono preferibile rispetto all'UML &quot;base&quot;, 
        in particolare per la rappresentazione dei legami tra la parte hardware 
        e la parte software, che pu&ograve; valere la pena sfruttare. E anche 
        SysML comincia ad essere supportato da alcuni strumenti di modellazione. 
        Per la maggior parte delle situazioni, per&ograve;, l'UML &quot;base&quot; 
        pu&ograve; risultare ampiamente sufficiente.</p>
      <hr />
      <p class="bold">Riferimenti</p>
      <ul>
        <li>Materiali su <a href="uml.htm">UML</a></li>
        <li>Materiali su <a href="sysml.htm">SysML</a></li>
		<li>Materiali su <a href="../businessmodeling/bpmn.htm">BPMN</a></li>

      </ul>
      <p>La documentazione ufficiale dei tre standard &egrave; disponibile sul sito <a href="http://www.omg.org" target="_blank">OMG</a>.</p>

     <hr />
	<p class="centered"><a href="../"> analisi-disegno.com </a>, servizi e materiali per lo sviluppo dei sistemi software, a cura di <a href="../a_comai/adriano_comai.htm">Adriano 
  		Comai</a>. </p>
</body>

</html>
		