<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML Basic 1.1//EN"
    "http://www.w3.org/TR/xhtml-basic/xhtml-basic11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>analisi-disegno.com - news 2009-04-24</title>
<meta name="keywords" content="casi d'uso, flow chart, software" />
<meta name="description" content="I casi d'uso vengono utilizzati in tutti i modi possibili, e anche impossibili, come se fossero un coltellino svizzero. Ma non conviene farlo." />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<meta name="author" content="Adriano Comai" />
<meta name="robots" content="noarchive" />
<link rel="stylesheet" type="text/css" href="/analisi-disegno.css" />
</head>

<body>
<p class="iniziale">analisi-disegno.com</p>
	<p class="menu"><a href="../">Homepage</a>&nbsp;| 
	<a href="../notiziario.html">Notiziario</a>&nbsp;| <a href="../welcome_e.html">In English</a></p>
    <hr />

      <h1>analisi-disegno.news - 24 aprile 2009</h1>
      <h2>I casi d'uso non sono flow chart</h2>
      <p>Si pu&ograve; usare il cacciavite come se fosse un martello, per piantare
chiodi. Oppure al posto di una pinza, per togliere quelli gi&agrave; piantati.
Il cacciavite pu&ograve; anche servire per tagliare il formaggio, volendo. Ma
non &egrave; fatto per quello, ed esistono strumenti migliori per tagliare il
formaggio.</p>	
      <p>Per i casi d'uso &egrave; lo stesso. Vengono usati in tutti i modi possibili, e
anche impossibili, come se fossero un coltellino svizzero milleusi. Ma
non conviene, perch&eacute; funzionano bene solo quando vengono usati per
quello che sono.</p>

      <p>Ho gi&agrave; scritto anni fa sui principali <a href="http://www.analisi-disegno.com/usecases/usecase_errori.htm">errori</a> 
	  nell'uso dei casi d'uso. E sul fatto che sono pi&ugrave; adatti a descrivere certi tipi di sistema, e 
	  <a href="http://www.analisi-disegno.com/usecases/usecase_ambito.htm">meno adatti per altri tipi di sistema</a>. Ma i casi d'uso si prestano ad utilizzi sempre pi&ugrave;
creativi, e quindi &egrave; il caso di riaffrontare il tema.</p>
	  <p>Per molti, i casi d'uso sono diagrammi. Per alcuni, il diagramma dei
casi d'uso &egrave; _IL_ diagramma UML (Unified Modeling Language). "Conosci
UML?" . "S&igrave;, ho fatto dei diagrammi dei casi d'uso".</p>
	  <p>I casi d'uso, invece, non sono diagrammi, sono descrizioni testuali
delle modalit&agrave; d'uso di un sistema. Come quelle che si possono trovare
nei manuali utente scritti bene. I casi d'uso servono a chiarire i
requisiti, a definire gli scenari di interazione tra utenti e sistema, e
come punto di partenza per la progettazione del software e la
definizione dei test.</p>
	  <p>Certo, c'&egrave; anche il diagramma dei casi d'uso. Che &egrave; il diagramma UML pi&ugrave;
povero, in termini semantici e sintattici. Il pi&ugrave; semplice tra tutti i
diagrammi. Perch&eacute; vuole essere solo una mappa dei modi in cui il sistema
pu&ograve; essere usato, e di quali sistemi esterni sono coinvolti in ogni
modalit&agrave; d'uso. Punto. Il diagramma dei casi d'uso non serve a chiarire
requisiti, non serve a definire scenari di interazione, non serve a
progettare software e test. &Egrave; solo una mappa, e per ogni caso d'uso
definisce solo il titolo.</p>
	  <p>Un diagramma povero. Ma anche un povero diagramma. Perch&eacute; poi, in certe
situazioni, viene usato come il cacciavite per piantare chiodi o per
tagliare il formaggio, nei modi pi&ugrave; creativi possibili. Ad esempio, i
seguenti:</p>
      <ol><li>Per rappresentare sequenze di attivit&agrave;, come un flow chart, usando i
casi d'uso come task, e frecce per collegarli in un passaggio di controllo.</li>
	  <li>Per rappresentare scomposizioni funzionali, creando mini casi d'uso e
usando in modo sistematico i meccanismi di "include" e "extend".</li>
	  <li>Per rappresentare input ed output nelle interazioni tra attori
(sistemi esterni) e sistema.</li>
	  <li>Per rappresentare la progettazione del software ad alto livello,
individuando in particolare componenti riusabili e legami tra funzioni
diverse.</li>
	  <li>Per rappresentare la progettazione del software a basso livello, ed in
particolare le interazioni tra componenti di front-end, di back-end e
data base.</li></ol>
     
	  <p>La creativit&agrave; &egrave; indubbiamente un valore, e spesso citiamo come un
aspetto positivo l'arte di arrangiarsi con ci&ograve; che si ha a disposizione.
Ad esempio, martellare con un cacciavite pu&ograve; essere utile, quando non si
ha un martello.</p>
        <p>Per ciascuno degli usi creativi che ho citato, per&ograve;, esistono in UML
altri strumenti, cioè altri diagrammi pi&ugrave; adeguati, che funzionano
meglio e con i quali ci si fa meno male.
Consiglio di dare un'occhiata alle mie <a href="http://www.analisi-disegno.com/StrumentiOperativi.htm">linee guida su casi d'uso
e modelli architetturali</a>, e magari anche al <a href="http://www.omg.org">manuale ufficiale UML</a>. E di non
maltrattare troppo i poveri casi d'uso.</p>
                    
      <hr />
        <h2>Segnalazioni</h2>
		
      <p>*** <strong>Il software design come fatto sociale</strong> ***</p>
      <p>Richard Gabriel &egrave; uno dei leader storici della comunit&agrave; dei software
design pattern.</p>
      <p>Ha pubblicato da poco uno scritto interessante, 
	  <a href="http://dreamsongs.org/DesignedAsDesigner.html">Designed as Designer</a>, in cui affronta la tesi
romantica della creazione di un design (di un'architettura) come
espressione totalmente autonoma di un'individualit&agrave;. Non &egrave; certo il
primo a smontare la creativit&agrave; romantica, ma la sua argomentazione &egrave;
supportata da esempi illuminanti.</p>
	  <p>Gabriel evidenzia come ogni design (di un edificio, di una poesia, di un
software) sia il frutto di due relazioni:</p>
<ul><li>del designer con altri designer, e pi&ugrave; in generale con altre persone
(collaboratori, revisori, ecc.)</li>
<li>del designer con il materiale trattato, che condiziona e influenza ogni
scelta di design</li></ul>
<p>Il design non &egrave; la semplice implementazione nella materia di una
creazione gi&agrave; avvenuta nella testa del progettista, ma un graduale e
progressivo processo di lavoro in cui le due relazioni (con la materia,
e con le opinioni e i prodotti di altre persone) prendono forma.</p>
      <hr />
	  
      <p>*** <strong>Product Owner</strong> ***</p>
     <p>Il Product Owner &egrave; uno dei ruoli principali di Scrum, uno dei 
	 <a href="http://www.analisi-disegno.com/processo/processiagili.htm">processi agili</a> pi&ugrave; diffusi.</p>
<p>In italiano, lo si pu&ograve; tradurre come "proprietario del prodotto", o
"responsabile del prodotto".</p>
<p>Dal punto di vista di chi sviluppa software, corrisponde in linea di
massima al ruolo di "committente", cio&egrave; di chi ha la responsabilit&agrave; di
decidere i requisiti da soddisfare, le priorit&agrave; di realizzazione,
l'accettabilit&agrave; dei risultati forniti dagli sviluppatori.</p>
<p>Certamente &egrave; il ruolo pi&ugrave; importante per il successo di un prodotto, di
un sistema. Ma &egrave; arduo da svolgere, perch&eacute; non esiste un percorso
formativo per diventare Product Owner, e pu&ograve; capitare che il ruolo non
sia riconosciuto in termini di autorit&agrave; e responsabilit&agrave; all'interno
delle organizzazioni.</p>
<p>Sul ruolo di Product Owner, uno <a href="http://www.agileproductdesign.com/blog/2009/product_owner_and_problem_shaped_hole.html">
	scritto interessante di Jeff Patton</a>.</p>
      <hr />
	  
      <p>*** <strong>24-Hour Knowledge Factory</strong> ***</p>
     <p>Tre turni: uno in Africa o Europa, uno in Asia, uno in America.</p>
<p>Tutti lavorano di giorno, alla luce del sole (anche con benefici per la
salute, dato che lavorare di notte aumenta i rischi di cancro al seno e
alla prostata).</p>
<p>L'articolo è di Amar Gupta, su <a href="http://doi.ieeecomputersociety.org/10.1109/MC.2009.25">IEEE Computer di gennaio 2009</a>.</p>
      <hr />
	  
      <p>*** <strong>Libro su SysML</strong> ***</p>
<p>Tim Weilkiens: <a href="http://www.amazon.com/Systems-Engineering-SysML-UML-Modeling/dp/0123742749/">
	Systems Engineering with SysML/UML: Modeling, Analysis, Design</a> (The OMG Press) - Morgan Kaufmann 2008</p>

<p>SysML &egrave; l'adattamento di UML per la rappresentazione di sistemi
complessi, di cui il software costituisce solo una tra le componenti.
Come UML, &egrave; uno <a href="http://www.analisi-disegno.com/uml/StandardOmg.htm">standard OMG</a>.</p>

<p>Il libro &egrave; una guida eccellente a SysML. La strutturazione &egrave; efficace,
con una chiara distinzione tra gli aspetti essenziali e le sottigliezze
della notazione, comunque con una trattazione graduale e approfondita di
tutti gli aspetti del linguaggio.
Ci&ograve; rende il testo utile sia per chi non sa nulla che per i progettisti
esperti, e in ogni caso molto pi&ugrave; chiaro della specifica ufficiale
dell'OMG, anche per la qualit&agrave; degli esempi usati.</p>


<hr />
      
      <p>Se volete, potete contribuire 
        ad ANALISI-DISEGNO:</p>
		<ul>
        <li>comunicando segnalazioni e commenti a <a href="mailto:adriano.comai@analisi-disegno.com">adriano.comai@analisi-disegno.com</a></li>
        <li>facendolo conoscere ad altre persone a cui possa interessare</li>
		</ul>
     <p>ANALISI-DISEGNO viene spedito a chi ne fa <a href="../notiziario.html">richiesta</a>. La pubblicazione
        non avviene con periodicit&agrave; predefinita.</p>
      <hr />
      <p><a href="../notiziario.html">Archivio notiziari</a> 
        | <a href="2009-03-analisidisegnonews.html">Notiziario precedente</a> | <a href="2009-09-analisidisegnonews.html">Notiziario successivo</a></p>

     <hr />
	<p class="centered"><a href="../"> analisi-disegno.com </a>, servizi e materiali per lo sviluppo dei sistemi software, a cura di <a href="../a_comai/adriano_comai.htm">Adriano 
  		Comai</a>. </p>
</body>

</html>
