<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML Basic 1.1//EN"
    "http://www.w3.org/TR/xhtml-basic/xhtml-basic11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>analisi-disegno.com - news 2009-03-03</title>
<meta name="keywords" content="manutenzione, debito tecnico, software" />
<meta name="description" content="Gli interventi di manutenzione del software possono migliorarne la qualità, riducendo il debito tecnico, oppure peggiorarla." />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<meta name="author" content="Adriano Comai" />
<meta name="robots" content="noarchive" />
<link rel="stylesheet" type="text/css" href="/analisi-disegno.css" />
</head>

<body>
<p class="iniziale">analisi-disegno.com</p>
	<p class="menu"><a href="../">Homepage</a>&nbsp;| 
	<a href="../notiziario.html">Notiziario</a>&nbsp;| <a href="../welcome_e.html">In English</a></p>
    <hr />

      <h1>analisi-disegno.news - 3 marzo 2009</h1>
      <h2>Manutenzione e debito tecnico</h2>
      <p>Ogni intervento che viene effettuato su un sistema software esistente ha una duplice valenza.</p>	
      <p>La prima valenza &egrave; relativa alla richiesta da cui &egrave; partito l'intervento (evolutiva o correttiva, 
	  a volte entrambe le cose insieme). L'intervento deve, innanzitutto, soddisfare tale richiesta.</p>

      <p>La seconda valenza riguarda lo stato complessivo di qualit&agrave; del sistema.
Ogni intervento pu&ograve; essere effettuato in modo pi&ugrave; o meno affrettato,
pi&ugrave; o meno professionale, risolvendo comunque la richiesta che lo ha
originato, ma con ricadute diverse sulla qualit&agrave; globale del sistema.</p>
      <p>Al termine di ogni intervento, la qualit&agrave; del sistema pu&ograve; essere rimasta
invariata. O migliorata. O peggiorata.</p>
      <p>Se l'intervento sul software ne ha peggiorato la qualit&agrave;, si pu&ograve; dire
che ha aumentato il debito tecnico del sistema.</p>
     
	  <p>La metafora del debito tecnico ("technical debt") &egrave; analoga al debito
finanziario che contraiamo quando chiediamo un mutuo o l'apertura di una
linea di credito.
Nel caso del debito finanziario, non solo dobbiamo rimborsare il
capitale, ma dobbiamo rimborsare anche gli interessi.
Nel caso del debito tecnico, ogni intervento futuro dovr&agrave; fare i conti
con il peggioramento della qualit&agrave; complessiva del sistema, e risulter&agrave;
quindi più costoso (interessi più elevati).</p>
        <p>L'intervento di manutenzione pu&ograve; per&ograve; migliorare la qualit&agrave;
complessiva del software, anzich&eacute; peggiorarla. I refactoring (le
ristrutturazioni del codice con l'obiettivo di migliorarne la qualit&agrave;
senza variarne le funzioni) sono utili anche e soprattutto dal punto di
vista economico, perch&eacute; riducono il debito tecnico e rendono più agevoli
le evoluzioni successive.</p>
      
        <p>Quali sono le variabili che influenzano il modo di effettuare
l'intervento, e quindi le successive ricadute in termini di debito tecnico?</p>

<ul>        <li>Competenza e la professionalit&agrave; dello sviluppatore. &egrave; la variabile che
ha il peso più rilevante.</li>
<li>Incentivi legati ad obiettivi di miglioramento o mantenimento della
qualit&agrave;. I comportamenti professionali possono essere incentivati,
quelli poco professionali possono essere penalizzati.</li>
<li>Stato di qualit&agrave; precedente all'intervento. La teoria dei "vetri
rotti" (secondo la quale più un ambiente urbano &egrave; gi&agrave; degradato, più &egrave;
probabile che vi si manifestino comportamenti incivili) vale anche nel
software. Un applicativo di scarsa qualit&agrave; favorisce interventi di
scarsa qualit&agrave; ("non vale la pena perdere del tempo per cercare di
metterlo a posto...").</li>
<li>Esistenza di test automatizzati di non regressione, sia a livello
tecnico (test unitari, test di integrazione) che a livello di sistema. I
test forniscono una rete di salvataggio che pu&ograve; velocizzare enormemente
ogni intervento.</li>
<li>Qualit&agrave; della documentazione esistente. La qualit&agrave; della
documentazione dipende da tre fattori: cosa &egrave; documentato, come, e quale
&egrave; il livello di aggiornamento. La documentazione ideale &egrave; minimale
(ridotta all'osso), in formato standard (UML), aggiornata.</li>
<li>Revisioni del codice (peer review), effettuate a posteriori o, come
nella programmazione in coppia, durante l'intervento.</li>
<li>Esistenza di controlli automatici sulla qualit&agrave; del codice.</li>
<li>Necessit&agrave; di far fronte a scadenze non prorogabili, ad esempio per
rispettare consegne concordate o livelli di servizio. In alcune
situazioni, aumentare in modo consapevole il debito tecnico pu&ograve; essere
(nel breve termine) l'unica strada percorribile.</li></ul>

<p>Sul debito tecnico, alcuni riferimenti in inglese:</p>

<ul><li>Un <a href="http://www.youtube.com/watch?v=pqeJFYwnkjE">video di Ward Cunningham</a>, l'ideatore del concetto (oltre che
ideatore dei Wiki e di Extreme Programming)</li>
<li>Uno <a href="http://martinfowler.com/bliki/TechnicalDebt.html">scritto di Martin Fowler</a></li>
<li>Uno <a href="http://www.construx.com/Page.aspx?hid=2801">scritto di Steve McConnell</a></li></ul>
              
      <hr />
        <h2>Segnalazioni</h2>
		
      <p>*** <strong>PMBOK 4</strong> ***</p>
      <p>Nuova edizione del Project Management Book of Knowledge (PMBOK), la
quarta, uscita il 31-12-2008.</p>
      <p>Il Project Management Institute (<a href="http://www.pmi.org">PMI</a>) ha pubblicato
un contemporaneo aggiornamento anche di altri tre propri standard:</p>
       <ul><li>Organizational Project Management Maturity Model (OPM3)</li>
       <li>Program Management</li>
       <li>Portfolio Management</li></ul>
      <hr />
	  
      <p>*** <strong>Sviluppo software evolutivo</strong> ***</p>
     <p>Un articolo di Peter Denning, Chris Gunderson e Rick Hayes-Roth, tre
esperti IT di lungo corso che lavorano attualmente per la US Navy, la
marina statunitense, segna a mio avviso una tappa importante nel
percorso verso la piena affermazione dei processi agili.</p>
<blockquote><p>"The software engineering community has hotly debated preplanned versus
agile processes. After a while they reached a truce where they agreed
that preplanning is best for large systems
where reliability and risk-avoidance are prime concerns, and agile is
best for small to medium systems where adaptability and user
friendliness are prime concerns.</p>
<p>We challenge that conclusion. Preplanning is ceasing to be a viable
option for large systems. [...]</p>
<p>All the evidence says that that evolutionary processes works for systems
large and small, and that risk seeking is the fastest route to fitness.
There is too much at stake to continue to allow us to be locked into a
process that does not work."</p></blockquote>

<p>L'articolo, "Evolutionary System Development", &egrave; stato pubblicato nel
numero di dicembre 2008 di <a href="http://cacm.acm.org/communications/">Communications of the ACM</a>.</p>
      <hr />
	  
      <p>*** <strong>Libro su BPMN</strong> ***</p>
<p>BPMN (Business Process Modeling Notation) &egrave; lo standard per la
rappresentazione dei processi di business, gestito dall'Object
Management Group (OMG).</p>

<p>Stephen White, il coordinatore del gruppo di lavoro che ha prodotto e fa
evolvere BPMN, ha pubblicato un testo sullo standard: "<a href="http://www.amazon.com/gp/product/0977752720/ref=cm_pdp_rev_itm_img_1">BPMN Modeling and
Reference Guide</a>".</p>

<p>Il libro non aggiunge nulla a quanto contenuto nella specifica ufficiale
OMG, scaricabile gratuitamente - ma &egrave; organizzato e scritto in un modo
più comprensibile, e costituisce comunque un'utile introduzione
all'argomento.</p>


<hr />
      
      <p>Se volete, potete contribuire 
        ad ANALISI-DISEGNO:</p>
		<ul>
        <li>comunicando segnalazioni e commenti a <a href="mailto:adriano.comai@analisi-disegno.com">adriano.comai@analisi-disegno.com</a></li>
        <li>facendolo conoscere ad altre persone a cui possa interessare</li>
		</ul>
     <p>ANALISI-DISEGNO viene spedito a chi ne fa <a href="../notiziario.html">richiesta</a>. La pubblicazione
        non avviene con periodicit&agrave; predefinita.</p>
      <hr />
      <p><a href="../notiziario.html">Archivio notiziari</a> 
        | <a href="2009-01-analisidisegnonews.html">Notiziario precedente</a> | <a href="2009-04-analisidisegnonews.html">Notiziario successivo</a></p>

     <hr />
	<p class="centered"><a href="../"> analisi-disegno.com </a>, servizi e materiali per lo sviluppo dei sistemi software, a cura di <a href="../a_comai/adriano_comai.htm">Adriano 
  		Comai</a>. </p>
</body>

</html>
