<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML Basic 1.1//EN"
    "http://www.w3.org/TR/xhtml-basic/xhtml-basic11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>analisi-disegno.com - news 2009-01-13</title>
<meta name="keywords" content="UML, BPMN, SysML, OMG" />
<meta name="description" content="Confronto e relazioni fra i tre standard dell'Object management Group (OMG): UML per il software, SysML per i sistemi non software e BPMN per i processi." />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<meta name="author" content="Adriano Comai" />
<meta name="robots" content="noarchive" />
<link rel="stylesheet" type="text/css" href="/analisi-disegno.css" />
</head>

<body>
<p class="iniziale">analisi-disegno.com</p>
	<p class="menu"><a href="../">Homepage</a>&nbsp;| 
	<a href="../notiziario.html">Notiziario</a>&nbsp;| <a href="../welcome_e.html">In English</a></p>
    <hr />

      <h1>analisi-disegno.news - 13 gennaio 2009</h1>
      <h2>Standard: UML, SysML, BPMN</h2>
      <p>L'Object Management Group (OMG) &egrave; un organismo che comprende le maggiori
realt&agrave; del software internazionale.</p>
		
      <p>L'OMG ha definito tre notazioni standard complementari:</p>
<ul><li>UML (Unified Modeling Language) per la rappresentazione del software.</li>
<li>SysML (System Modeling Language) per la rappresentazione dei sistemi
"non software" o "non solo software".</li>
<li>BPMN (Business Process Modeling Notation) per la rappresentazione dei
processi.</li></ul>
      <p>Purtroppo questi standard si sovrappongono, almeno in parte. Quindi &egrave;
opportuno chiarire l'ambito delle sovrapposizioni, per chi li vuole
usare senza essere costretto ad addentrarsi nelle intricate logiche
dell'OMG.</p>
      <p>1.UML &egrave; nato prima, nel 1997, ed ha avuto una notevole diffusione nel
campo del software, dove &egrave; diventato effettivamente lo standard
internazionale. Ma &egrave; stato anche usato molto per la rappresentazione di
sistemi non software, ad esempio hardware. E molto usato anche per la
rappresentazione, a livello di business, di processi e strutture
organizzativi.
</p>
      <p>2.BPMN &egrave;; stato creato al di fuori dall'OMG, nel 2004, dalla Business
Process Management Initiative (BPMI), un consorzio di produttori di
strumenti che giudicavano UML troppo poco specifico per la
rappresentazione dei processi di business.</p>
     
	  <p>3.Nel 2006 la BPMI &egrave;; confluita nell'OMG, e BPMN &egrave;; stato preso
in carico come proprio standard dall'OMG. Con una sovrapposizione,
perch&eacute; l'unico diagramma previsto da BPMN (Business Process Diagram) &egrave;;
un flow chart, esattamente come l'Activity Diagram di UML, che ha una
notazione leggermente diversa.
</p>
        <p>4.L'ipotesi di integrare UML e BPMN (due standard in parziale
sovrapposizione emanati e gestiti dallo stesso organismo) &egrave; stata finora
ostacolata dai produttori di strumenti di modellazione. La prossima
versione di BPMN, prevista per il 2009, non risolver&agrave; il problema.</p>
      
        <p>5.Per rappresentare sistemi "non software", l'OMG ha pubblicato nel 2007
il nuovo standard SysML. In questo caso, la sovrapposizione con UML &egrave;
ancora pi&ugrave; forte, ma al tempo stesso meno critica. Pi&ugrave; forte, perch&eacute; UML
e SysML hanno molti diagrammi in comune; peraltro, non tutti i diagrammi
UML sono inclusi in SysML, dove invece si trovano altri diagrammi non
previsti in UML. Ma meno critica, perch&eacute; SysML &egrave; un "profilo" di UML,
cio&egrave; una derivazione di UML compatibile con il linguaggio base.</p>
        <p>In sintesi, quale standard usare? Di seguito, qualche indicazione di
massima.
</p>
<p>Per chi deve rappresentare sistemi software, UML &egrave; la scelta naturale.
</p>
<p>Per chi deve rappresentare processi di business, e null'altro, BPMN &egrave;;
una scelta conveniente. Si pu&ograve; discutere sul fatto che sia pi&ugrave; o meno
efficace ed intuitiva di altre notazioni di tipo flow chart, ma &egrave;; uno
standard. Tra l'altro, sono disponibili diversi strumenti, anche
gratuiti, per la modellazione BPMN.
</p>
<p>Per chi deve rappresentare sistemi "non software" o per i quali il
software costituisce solo una parte e non il tutto, pu&ograve; essere utile
SysML. Ha alcuni costrutti che lo rendono preferibile rispetto all'UML
"base", in particolare per la rappresentazione dei legami tra la parte
hardware e la parte software, che pu&ograve; valere la pena sfruttare. Anche
SysML comincia ad essere supportato da alcuni strumenti di modellazione.
Per la maggior parte delle situazioni di modellazione di sistemi
complessi, comunque, l'UML "base" pu&ograve; risultare ampiamente sufficiente.
</p>
<p>Alcuni riferimenti:
</p>
<ul><li>I miei materiali su <a href="http://www.analisi-disegno.com/uml/uml.htm">UML</a>, <a href="../uml/sysml.htm">SysML</a> e
<a href="http://www.analisi-disegno.com/businessmodeling/bpmn.htm">BPMN</a></li>
<li>Il sito <a href="http://www.omg.org">OMG</a></li>
</ul>
              
      <hr />
        <h2>Segnalazioni</h2>
		
      <p>*** <strong>Modelli di stima dei costi nel software</strong> ***</p>
      <p>Cocomo (Constructive Cost Model) &egrave;; ritenuto comunemente il modello per
la stima dei costi pi&ugrave; completo ed affidabile in ambito software.
</p>
      <p>"Achievements and Challenges in Cocomo-Based Software Resource
Estimation" (su IEEE Software, September-October 2008) &egrave; un <a href="http://www2.computer.org/portal/web/csdl/doi/10.1109/MS.2008.133">articolo</a>
scritto dal padre di Cocomo, Barry Boehm, insieme a Ricardo Valerdi del
MIT.</p>

<p>L'articolo fa il punto sullo stato dell'arte, le criticit&agrave; e le tendenze
nell'evoluzione dei modelli previsionali.</p>
      <hr />
	  
      <p>*** <strong>Risorse educative gratuite</strong> ***</p>
     <p> "Global Warming Toward Open Educational Resources", un articolo di
Richard G. Baraniuk e C. Sidney Burrus su <a href="http://cacm.acm.org/toc-sep-2008"> Communications of the ACM,
settembre 2008</a></p>
<p>Sulla diffusione via Internet, da parte di prestigiose universit&agrave;
internazionali, di ambienti e strumenti gratuiti per la formazione. Tra cui:</p>

<ul><li>MIT: <a href="http://mit.edu/ocw">Open-CourseWare</a> e
<a href="http://www.ocwconsortium.org/">OCW consortium</a></li>
<li>Rice University: <a href="http://cnx.org/">Connexions</a></li>
<li>Open University: <a href="http://openlearn.open.ac.uk/">OpenLearn</a></li>
<li>Carnegie Mellon University: <a href="http://cmu.edu/oli">Open Learning Initiative</a></li></ul>
<hr />
	  
      <p>*** <strong>CMMI e Agile</strong> ***</p>
<p>Il Software Engineering Institute (SEI) &egrave;; un'istituzione finanziata dal
governo e da grandi aziende USA. Nei miei corsi raccomando <a href="http://www.sei.cmu.edu">il sito del SEI</a> come una delle fonti pi&ugrave;
autorevoli di documentazione sulle tematiche dello sviluppo software.
Documenti di alta qualit&agrave;, e gratuiti.</p>

<p>Tra le altre cose, il SEI &egrave; noto per aver creato il CMMI-SW (Capability
Maturity Model Integration), un modello per la valutazione del grado di
maturit&agrave; delle organizzazioni che sviluppano software. Modello applicato
dal governo americano e da molte organizzazioni internazionali per
selezionare i propri fornitori nello sviluppo software.</p>

<p>Il CMMI-SW &egrave;; spesso ritenuto, a torto, come un modello che porta a
burocratizzare lo sviluppo, pesante e con effetti negativi sulla
produttivit&agrave; e sulla flessibilit&agrave;. Pu&ograve; essere applicato cos&igrave;, &egrave; vero. Ma
pesantezza e burocrazia non sono affatto insite nel modello, bens&igrave; sono
causate da chi lo interpreta in modo superficiale.</p>

<p>Una recente pubblicazione del SEI, "<a href="http://www.sei.cmu.edu/publications/documents/08.reports/08tn003.html">CMMI or Agile: Why Not Embrace
Both!</a>" evidenzia la compatibilit&agrave; del CMMI con gli approcci agili.   </p> 
<hr />
      
      <p>Se volete, potete contribuire 
        ad ANALISI-DISEGNO:</p>
		<ul>
        <li>comunicando segnalazioni e commenti a <a href="mailto:adriano.comai@analisi-disegno.com">adriano.comai@analisi-disegno.com</a></li>
        <li>facendolo conoscere ad altre persone a cui possa interessare</li>
		</ul>
     <p>ANALISI-DISEGNO viene spedito 
        a chi ne fa <a href="../notiziario.html">richiesta</a>. La pubblicazione
        non avviene con periodicit&agrave;; predefinita.</p>
      <hr />
      <p><a href="../notiziario.html">Archivio notiziari</a> 
        | <a href="2008-11-analisidisegnonews.html">Notiziario precedente</a> | <a href="2009-03-analisidisegnonews.html">Notiziario successivo</a></p>

     <hr />
	<p class="centered"><a href="../"> analisi-disegno.com </a>, servizi e materiali per lo sviluppo dei sistemi software, a cura di <a href="../a_comai/adriano_comai.htm">Adriano 
  		Comai</a>. </p>
</body>

</html>
