<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML Basic 1.1//EN"
    "http://www.w3.org/TR/xhtml-basic/xhtml-basic11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>analisi-disegno.com - news 2010-05-24</title>
<meta name="keywords" content="tecniche, metodi, analisi, sistemi, contesto, diagramma" />
<meta name="description" content="Definire il contesto del sistema." />
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<meta name="author" content="Adriano Comai" />
<meta name="robots" content="noarchive" />
<link rel="stylesheet" type="text/css" href="/analisi-disegno.css" />
</head>

<body>
<p class="iniziale">analisi-disegno.com</p>
	<p class="menu"><a href="../">Homepage</a>&nbsp;| 
	<a href="../notiziario.html">Notiziario</a>&nbsp;| <a href="../welcome_e.html">In English</a></p>
    <hr />

      <h1>analisi-disegno.news - 24 maggio 2010</h1>
      <h2>Definire il contesto del sistema</h2>
	  <p>Definire il contesto significa stabilire i confini del sistema, e nello
stesso tempo chiarire con quali elementi esterni interagisce.</p>
	  <p>Il termine contesto viene dal latino "contexere", e il suo significato
originario &egrave; "tessuto insieme". Un sistema, di qualunque tipo esso sia,
&egrave; parte di una trama intessuta, di una rete di relazioni con altri
sistemi. Non pu&ograve; essere compreso guardandolo isolatamente, ma solo
quando lo vediamo collocato nel suo habitat, nell'ambiente in cui
interagisce con altri elementi.</p>
      <p>Definire il contesto significa tracciare il confine (in latino,
"finis"), distinguendo tra cosa &egrave; dentro il sistema e cosa &egrave; fuori. Dal
punto di vista strutturale, vuol dire decidere quali elementi sono da
considerare come parti interne (quindi da realizzare o da incorporare),
quali invece siano esterne (quindi da considerare solo in termini di
interazioni). Dal punto di vista funzionale, si tratta di stabilire
quali funzionalit&agrave; dovrà offrire il sistema ai suoi utenti.</p>
      <p>Nello sviluppo di un nuovo sistema software, la definizione del contesto
&egrave; una delle prime attivit&agrave;, e insieme una delle pi&ugrave; importanti. Chiarire
cosa sar&agrave; dentro e cosa sar&agrave; fuori; comprendere quali interazioni con
l'esterno vadano gestite.</p>
	  <p>La definizione del contesto &egrave; influenzata dagli obiettivi del
committente del progetto, e costituisce un punto di partenza
indispensabile per la scoperta e l'approfondimento dei requisiti.
Naturalmente, all'inizio dello sviluppo il contesto non &egrave; scolpito nella
pietra. &Egrave; solo una ipotesi di lavoro che potr&agrave; essere modificata
nell'evoluzione del progetto, man mano che i requisiti si chiariscono e
le scelte architetturali modellano la forma del sistema.</p>
	  <p>Ma anche se &egrave; solo una ipotesi di lavoro, delineare al pi&ugrave; presto i
confini del sistema &egrave; necessario per la comprensione reciproca tra chi &egrave;
coinvolto nel progetto. Quando la definizione del contesto non &egrave;
condivisa, il livello di incertezza e di ambiguit&agrave; &egrave; troppo alto per
poter chiarire i requisiti e definire un'architettura di sistema
efficace ed efficiente.</p>

      <hr />
        <h2>Segnalazioni</h2>
		
      <p>*** <strong>Semat</strong> ***</p>
      <p>Semat &egrave; un'iniziativa di rifondazione dell'ingegneria del software,
avviata nel novembre 2009. Proposta da Ivar Jacobson, Bertrand Meyer e Richard Soley (OMG), ha un
<a href="http://www.semat.org/bin/view">sito web</a> dove &egrave; possibile consultare obiettivi, documenti prodotti e
stato dei lavori.</p>

<p>Interessante anche la <a href="http://alistair.cockburn.us/A+Detailed+Critique+of+the+SEMAT+Initiative">critica di Alistair Cockburn</a>, che si è ritirato
dall'iniziativa dopo il primo meeting di lavoro.</p>
      
      <hr />
	  
      <p>*** <strong>iPad e usabilit&agrave;</strong> ***</p>
<p>Uno studio del Nielsen Norman group, <a href="http://www.nngroup.com/reports/mobile/ipad/">scaricabile gratuitamente</a>.</p>

      <hr />
	  
      <p>*** <strong>BABOK online</strong> ***</p>
<p>Babok sta per Business Analysis Book of Knowledge, una guida alle
attivit&agrave; di analisi prodotta da un organismo chiamato <a href="http://www.theiiba.org">IIBA
(International Institute of Business Analysis)</a>.</p>

<p>Il Babok &egrave; acquistabile come libro, ma pu&ograve; anche essere letto online
gratuitamente <a href="http://books.google.com/books?id=CFHw8jSEWwkC&lpg=PP1&dq=A%20guide%20to%20business%20analysis%20body%20of%20knowledge&pg=PR1#v=onepage&q&f=true">su Google Books</a>.</p>

      <hr />

      <p>Se volete, potete contribuire 
        ad ANALISI-DISEGNO:</p>
		<ul>
        <li>comunicando segnalazioni e commenti a <a href="mailto:adriano.comai@analisi-disegno.com">adriano.comai@analisi-disegno.com</a></li>
        <li>facendolo conoscere ad altre persone a cui possa interessare</li>
		</ul>
     <p>ANALISI-DISEGNO viene spedito a chi ne fa <a href="../notiziario.html">richiesta</a>. La pubblicazione
        non avviene con periodicit&agrave; predefinita e regolare.</p>
      <hr />
      <p><a href="../notiziario.html">Archivio notiziari</a> 
        | <a href="2010-04-analisidisegnonews.html">Notiziario precedente</a> | <a href="2010-06-analisidisegnonews.html">Notiziario successivo</a></p>

     <hr />
	<p class="centered"><a href="../"> analisi-disegno.com </a>, servizi e materiali per lo sviluppo dei sistemi software, a cura di <a href="../a_comai/adriano_comai.htm">Adriano 
  		Comai</a>. </p>
</body>

</html>
