<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML Basic 1.1//EN"
    "http://www.w3.org/TR/xhtml-basic/xhtml-basic11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>analisi-disegno.com - 2002 - Etica dello sviluppo software.</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" /> 
<link rel="stylesheet" type="text/css" href="../../analisi-disegno.css" />
<!--[if gte mso 9]><xml>
 <o:DocumentProperties>
  <o:Author>Adriano Comai</o:Author>
  <o:Template>Normal</o:Template>
  <o:LastAuthor>Adriano Comai</o:LastAuthor>
  <o:Revision>2</o:Revision>
  <o:TotalTime>494</o:TotalTime>
  <o:Created>2000-11-30T20:52:00Z</o:Created>
  <o:LastSaved>2000-11-30T20:52:00Z</o:LastSaved>
  <o:Pages>4</o:Pages>
  <o:Words>2274</o:Words>
  <o:Characters>12963</o:Characters>
  <o:Company> </o:Company>
  <o:Lines>108</o:Lines>
  <o:Paragraphs>25</o:Paragraphs>
  <o:CharactersWithSpaces>15919</o:CharactersWithSpaces>
  <o:Version>9.3821</o:Version>
 </o:DocumentProperties>
</xml><![endif]--><!--[if gte mso 9]><xml>
 <w:WordDocument>
  <w:HyphenationZone>14</w:HyphenationZone>
  <w:DisplayHorizontalDrawingGridEvery>0</w:DisplayHorizontalDrawingGridEvery>
  <w:DisplayVerticalDrawingGridEvery>0</w:DisplayVerticalDrawingGridEvery>
  <w:UseMarginsForDrawingGridOrigin/>
  <w:Compatibility>
   <w:FootnoteLayoutLikeWW8/>
   <w:ShapeLayoutLikeWW8/>
   <w:AlignTablesRowByRow/>
   <w:ForgetLastTabAlignment/>
   <w:LayoutRawTableWidth/>
   <w:LayoutTableRowsApart/>
  </w:Compatibility>
 </w:WordDocument>
</xml><![endif]-->
<style>
<!--
 /* Style Definitions */
p.MsoNormal, li.MsoNormal, div.MsoNormal
	{mso-style-parent:"";
	margin:0cm;
	margin-bottom:.0001pt;
	mso-pagination:widow-orphan;
	font-size:11.0pt;
	mso-bidi-font-size:10.0pt;
	font-family:Arial;
	mso-fareast-font-family:"Times New Roman";
	mso-bidi-font-family:"Times New Roman";}
a:link, span.MsoHyperlink
	{color:blue;
	text-decoration:underline;
	text-underline:single;}
a:visited, span.MsoHyperlinkFollowed
	{color:purple;
	text-decoration:underline;
	text-underline:single;}
@page Section1
	{size:595.3pt 841.9pt;
	margin:70.85pt 2.0cm 2.0cm 2.0cm;
	mso-header-margin:36.0pt;
	mso-footer-margin:36.0pt;
	mso-paper-source:0;}
div.Section1
	{page:Section1;}
-->
</style>
<!--[if gte mso 9]><xml>
 <o:shapedefaults v:ext="edit" spidmax="2050"/>
</xml><![endif]--><!--[if gte mso 9]><xml>
 <o:shapelayout v:ext="edit">
  <o:idmap v:ext="edit" data="1"/>
 </o:shapelayout></xml><![endif]-->
<meta name="Microsoft Border" content="tb, default">
</head>

<body lang=IT link=#0000FF vlink=#800080 style='tab-interval:35.4pt' bgcolor="#FFFFFF">
<!--msnavigation-->
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td>

<p class="iniziale">analisi-disegno.com</p>
	<p class="menu"><a href="../../index.html">Homepage</a>&nbsp;| 
	<a href="../../notiziario.html">Notiziario</a>&nbsp;| <a href="../../welcome_e.html">In English</a></p>
    <hr />
  </tr><!--msnavigation--></table><!--msnavigation-->
<table border="0" cellpadding="0" cellspacing="0" width="100%">
  <tr> 
    <!--msnavigation-->
    <td valign="top" height="1468"> 
      <div class=Section1> 
        <p class=MsoNormal><font face="Arial, Helvetica, sans-serif">(pubblicato 
          su ZeroUno n.243, aprile 2002)</font></p>
        <p class=MsoNormal>&nbsp;</p>
        <p class=MsoNormal><font face="Arial, Helvetica, sans-serif"><b><font size="+2">Etica 
          dello sviluppo software. I perch&eacute; di una traduzione.</font></b><br>
          Di Adriano Comai e Anna Pegna</font></p>
        <p><font face="Arial, Helvetica, sans-serif">Sviluppare software pu&ograve; 
          essere appassionante. Il problema ti prende, provi a risolverlo, tenti 
          una strada, saltano fuori anomalie, pensi a quali possono essere le 
          ragioni, scopri la causa, correggi, riprovi. Poi, prima o poi, funziona, 
          e quando funziona &egrave; una bella sensazione. Ci si possono passare 
          ore, come di fronte a un videogame - ma &egrave; pi&ugrave; appagante, 
          quando &egrave; un'attivit&agrave; a cui riusciamo ad attribuire un 
          senso, un significato..<br>
          Sviluppare software pu&ograve; essere frustrante. Quando tutto concorre 
          a toglierti le motivazioni. Quando ti assegnano dei compiti insensati, 
          o da svolgere in modo insensato. Quando la burocrazia o le politiche 
          della organizzazione per cui lavori fanno di tutto per diminuire la 
          qualit&agrave; e la produttivit&agrave; del tuo lavoro. Quando il fatto 
          che tu lavori bene o male non &egrave; riconosciuto, &egrave; indifferente 
          ai tuoi capi.</font></p>
        <p><font face="Arial, Helvetica, sans-serif">Oltre a queste valenze &quot;soggettive&quot;, 
          lo sviluppo del software ha per&ograve; anche una dimensione etica e 
          sociale, che non sempre emerge alla nostra coscienza, e che riguarda 
          gli utilizzatori e i committenti del prodotto sviluppato; o magari l'interesse 
          pubblico, della societ&agrave; nel suo insieme.<br>
          Non tutto ci&ograve; che gira &egrave; buono; non tutto ci&ograve; che 
          produciamo &egrave; &quot;inodore&quot;. A volte un prodotto arriva 
          da societ&agrave; o individui disonesti; oppure contiene vincoli o rigidit&agrave; 
          che peggioreranno il lavoro di chi dovr&agrave; usarlo; oppure, pi&ugrave; 
          semplicemente, non &egrave; stato testato a sufficienza. Anche senza 
          arrivare ai virus, per i quali l'intenzione distruttiva &egrave; evidente, 
          a volte ci&ograve; che viene prodotto dagli sviluppatori software &egrave; 
          dannoso anzich&eacute; utile alla societ&agrave;.</font></p>
        <p><font face="Arial, Helvetica, sans-serif">Molte attivit&agrave; della 
          nostra vita quotidiana dipendono dal software.Se funziona, ci semplifica 
          le cose; se non funziona, o se funziona male, ce le pu&ograve; complicare. 
          <br>
          Rilasciare software con errori pu&ograve; essere un atto criminale, 
          che danneggia la vita di esseri umani: si pensi al software che fa funzionare 
          un pace-maker, o che controlla aerei, treni, automobili, armamenti. 
          Con effetti meno gravi, un software inadeguato pu&ograve; deteriorare 
          un servizio importante per la collettivit&agrave;, come accadde pochi 
          mesi fa per i sistemi di regolazione del traffico ferroviario o di gestione 
          aereoportuale, e come purtroppo spesso accade nel nostro rapporto con 
          uffici pubblici, banche, assicurazioni, societ&agrave; di servizi... 
          E in molte organizzazioni medie e grandi, sono frequenti le critiche 
          che le aree aziendali rivolgono al settore sistemi, in merito alla qualit&agrave; 
          delle applicazioni informatiche ed al livello di servizio fornito.<br>
          Sempre pi&ugrave; frequentemente, a fronte di sistemi che non funzionano, 
          la pubblica opinione manifesta dubbi e critiche sulla affidabilit&agrave; 
          di chi li ha prodotti. E questi dubbi stanno spingendo le principali 
          organizzazioni professionali informatiche ed alcuni governi (ha iniziato 
          lo stato del Texas) a richiedere una certificazione per gli sviluppatori 
          software, cos&igrave; come viene richiesta ad esempio per ingegneri 
          ed architetti.</font></p>
        <p><font face="Arial, Helvetica, sans-serif">Sviluppare software &egrave; 
          un mestiere che ha implicazioni sociali, e comporta un insieme di responsabilit&agrave; 
          nei confronti di chi lo ha commissionato, di chi lo acquista e di chi 
          lo utilizza. Questo &egrave; lo spirito di fondo del Codice Etico e 
          di Pratica Professionale dello Sviluppo Software, promulgato nel 1999 
          dall'ACM (Association for Computing Machinery) e dall'IEEE-Computer 
          Society, le due maggiori organizzazioni professionali internazionali 
          in campo informatico.</font></p>
        <p><font face="Arial, Helvetica, sans-serif">A ben guardare, poi, la dimensione 
          etica non riguarda solo il rapporto tra committenti, utenti e fornitori 
          di software, bens&igrave; anche il lavoro quotidiano degli stessi sviluppatori. 
          Lo sviluppo software &egrave; in genere un'attivit&agrave; sociale, 
          svolta all'interno di un gruppo di lavoro, nell'ambito di una organizzazione 
          o di un'azienda, caratterizzata da propri obiettivi, da rapporti gerarchici 
          definiti, da un insieme di concrete relazioni umane.<br>
          Nel caso particolare dello sviluppo software, il modo in cui queste 
          relazioni vengono gestite ha una valenza etica intrinseca, ma influenza 
          anche la qualit&agrave; di ci&ograve; che viene prodotto dal gruppo 
          di lavoro, e quindi ha un impatto, sia pure indiretto, sui clienti e 
          sugli utilizzatori del software rilasciato.</font></p>
        <p><font face="Arial, Helvetica, sans-serif"><b>Finalit&agrave; del Codice 
          Etico</b></font></p>
        <p><font face="Arial, Helvetica, sans-serif">Il Codice &egrave; il frutto 
          del lavoro di anni di una task force internazionale, per definire &quot;uno 
          standard per l'insegnamento e la pratica dello sviluppo software, che 
          documenta gli obblighi etici e professionali degli sviluppatori software. 
          Intende informare gli sviluppatori sul livello di professionalit&agrave; 
          che la societ&agrave; si aspetta da loro, su come i loro colleghi aspirano 
          a comportarsi, su cosa aspettarsi l'uno dall'altro. Il Codice intende 
          inoltre informare l'opinione pubblica sulle responsabilit&agrave; inerenti 
          la professione dello sviluppatore software&quot;.<br>
          In termini meno ufficiali, il codice vuole mostrare a coloro che stanno 
          imparando il &quot;mestiere&quot;, che &egrave; possibile mantenere 
          degli ideali e una coscienza unitaria, senza lacerazioni e contraddizioni 
          tra i propri diversi interessi; avere la soddisfazione per un lavoro 
          ben fatto; condividere le proprie conoscenze professionali con altri; 
          sapere che da ci&ograve; che si fa non verr&agrave;, per quanto &egrave; 
          umanamente possibile, un danno ad altri. Che &egrave; possibile rispondere 
          di s&igrave; ai nostri figli, quando ci chiederanno se il nostro lavoro 
          ci soddisfa.</font></p>
        <p><font face="Arial, Helvetica, sans-serif"><b>La traduzione italiana</b></font></p>
        <p><font face="Arial, Helvetica, sans-serif">Approvata dopo un lungo e 
          minuzioso esame dalla task force internazionale di ACM e IEEE-Computer 
          Society, questa traduzione nasce da un dato di fatto: in Italia, diversamente 
          da quanto accade in altri paesi, la discussione sugli aspetti etici 
          legati allo sviluppo del software non si &egrave; ancora avviata. O 
          meglio, mentre la consapevolezza delle implicazioni sociali dei sistemi 
          software si sta facendo strada nella pubblica opinione, &egrave; invece 
          quasi assente tra i professionisti dell'informatica, che si considerano 
          esclusivamente come dei tecnici e si disinteressano, spesso, delle ricadute 
          del loro lavoro su clienti ed utilizzatori.</font></p>
        <p><font face="Arial, Helvetica, sans-serif">La traduzione in italiano 
          ha rispettato fedelmente lo stile secco e prescrittivo della versione 
          originale inglese. Ne &egrave; uscito un testo certamente ruvido e poco 
          musicale dal punto di vista linguistico, ma non ambiguo. </font></p>
        <p><font face="Arial, Helvetica, sans-serif">Abbiamo dovuto affrontare 
          alcuni problemi semantici: come tradurre, ad esempio, l'americano &quot;software 
          engineer&quot;, visto che l'espressione &quot;ingegnere software&quot; 
          non &egrave; diffusa in Italia. Negli USA, e a livello internazionale, 
          viene usata per riferirsi a tutti i soggetti coinvolti in modo attivo 
          nell'analisi, progettazione, realizzazione e test di software. In Italia, 
          ben pochi dei soggetti coinvolti in tali attivit&agrave; si riconoscono 
          in questa espressione linguistica. Il rischio, pertanto, era di fare 
          intendere, con una traduzione letterale, che si tratti di un Codice 
          rivolto esclusivamente ai laureati in Ingegneria che si occupano di 
          software, mentre cos&igrave; non &egrave;. <br>
          Inoltre, l'espressione &quot;Software Engineering&quot;, che invece 
          in Italia &egrave; diffusa, ha qui da noi una connotazione di &quot;teorie 
          e pratiche per il miglioramento delle modalit&agrave; di produzione 
          del software&quot;, mentre a livello internazionale denota semplicemente 
          il campo dello sviluppo e della manutenzione di software.<br>
          Le traduzioni possibili erano quindi tre: &quot;sviluppatore&quot;, 
          con il corrispondente &quot;sviluppo&quot; per descriverne l'attivit&agrave;; 
          o &quot;progettista&quot; e &quot;progettazione&quot; oppure &quot;produttore&quot; 
          e il relativo &quot;produzione&quot;. In tutti i casi esistevano limiti 
          semantici; e la scelta che abbiamo fatto, quella di chiamare costantemente 
          &quot;sviluppatore&quot; l'inglese &quot;engineer&quot; ci &egrave; 
          sembrata la migliore.</font></p>
        <p><font face="Arial, Helvetica, sans-serif">Altra questione delicata. 
          Il termine &quot;sviluppatore&quot; ha una connotazione di genere, e 
          non avevamo certo intenzione di escludere, in qualit&agrave; di soggetti 
          del Codice Etico, le numerose donne che lavorano nel settore. Per rendere 
          conto del valore delle molte sviluppatrici che conosciamo, sarebbe stato 
          necessario usare estensivamente la doppia desinenza. Riempire il testo, 
          gi&agrave; di per s&eacute; abbastanza pesante e ripetitivo, di &quot;sviluppatore/-trice&quot; 
          ci &egrave; sembrato per&ograve; sgradevole - beati, in questo, gli 
          americani che hanno un unico sesso informatico. Abbiamo quindi deciso 
          di utilizzare il solo termine maschile, confidando nella intelligenza 
          dei lettori ed in particolare nella comprensione delle lettrici.</font></p>
        <p></p>
      <hr />
      <p><a href="../../articoli.htm">Elenco pubblicazioni</a>.</p>

	<hr />
	<p class="centered"><a href="../../index.html"> analisi-disegno.com </a>, servizi e materiali per lo sviluppo dei sistemi software, a cura di <a href="../../a_comai/adriano_comai.htm">Adriano 
  		Comai</a>. </p>  
</body>
</html>
